# N x M (4 <= 500) 크기의 종이에 숫자(<=1000) 쓰여져 있음
# 테트로미노 회전,대칭 가능하고, 종이 위에 테트로미노를 한개 놓음
# 출력 : 테트로미노가 놓인 칸에 쓰인 수들의 합의 최댓값

#1 브루트포스
shape_list = [[[0,1],[0,2],[0,3]],
            [[1,0],[2,0],[3,0]],

            [[0,1],[1,0],[1,1]],
            
            [[1,0],[1,1],[2,1]],
            [[1,0],[0,1],[-1,1]],
            [[0,1],[-1,1],[-1,2]],
            [[0,1],[1,1],[1,2]],
            
            [[1,0],[2,0],[2,1]],
            [[0,1],[1,1],[2,1]],
            [[1,0],[2,0],[2,-1]],
            [[0,1],[1,0],[2,0]],
            [[1,0],[0,1],[0,2]],
            [[0,1],[0,2],[-1,2]],
            [[1,0],[1,1],[1,2]],
            [[0,1],[0,2],[1,2]],

            [[1,-1],[1,0],[1,1]],
            [[0,1],[0,2],[1,1]],
            [[1,0],[2,0],[1,1]],
            [[-1,1],[0,1],[1,1]]]

N, M = map(int, input().split())
paper = [list(map(int, input().split())) for _ in range(N)]
check = [[0 for _ in range(M)] for _ in range(N)]
max_num = 0
for i in range(N):
    for j in range(M):
        for shape in shape_list:
            num = paper[i][j]
            for s in shape:
                nx = i + s[0]
                ny = j + s[1]
                if (0 <= nx < N) and (0 <= ny < M):
                    num += paper[nx][ny]
            if(max_num < num):
                max_num = num
print(max_num)
         
#2 DFS + 백트래킹
